
Процедура ЗаполнитьСписокБанков()
	PSB =РеквизитФормыВЗначение("Объект").ПолучитьМакет("PSB");
	Sbr = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Sbr");
	КартинкаPSB=Новый Картинка(PSB);
	КартинкаSbr=Новый Картинка(Sbr);
	Элементы.Банк.СписокВыбора.Добавить("ПСБ","Промсвязьбанк" , ,КартинкаPSB);
	Элементы.Банк.СписокВыбора.Добавить("Сбербанк", , , КартинкаSbr);
КонецПроцедуры

Процедура ЗаполнитьСписокУслуг()
	Если Услуги.Количество()=0 Тогда
		Услуги.Добавить("Командировочные расходы");
		Услуги.Добавить("Прочие поступления денежных средств компенсации затрат федерального бюджета");
		Услуги.Добавить("Возмещение причиненного военному имуществу ущерба");
		Услуги.Добавить("Возмещение причиненного военному имуществу ущерба, возникшего до 01.01.2020");
		Услуги.Добавить("Штрафы за нарушение законодательства в области обеспечения санитарно-эпидемиологического благополучия населения");
	КонецЕсли;
	
	Если Услуги.ОтметитьЭлементы("Выберите услсугу") Тогда
		СписокУслуг="";
		Для каждого Услуга Из Услуги Цикл
			Если НЕ Услуга.Пометка Тогда
				Продолжить;
			КонецЕсли;
			Если ПустаяСтрока(СписокУслуг) Тогда
				СписокУслуг=Услуга.Значение;
			Иначе
				СписокУслуг=СписокУслуг+", "+Услуга.Значение;
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокБанков();	
КонецПроцедуры



&НаКлиенте
Процедура СписокУслугНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗаполнитьСписокУслуг();
КонецПроцедуры


